# Pandas 
Pandas is used for 
 - DATA Analysis:  Graphs, Reports and presentations 
  We have to define our requirements 

  **Why Pandas**

- Virtual part of business
- Learn and adopt
- Data Driven Decision Making 
- many more ...

  
 - DATA Manipulation:  It make more organized and readable. 
    - Purpose:
         - Consistent data
         - Project related data
         - Create more value for data
         - Remove and ignore data
         - Getting data
         - Tidy your data
         - Filter according to the need 
         - Arrange the data 
         - Merge the data sets if any
         - Split the data 
         - Missing values 
         - Duplicate values 
         - We take information from pictures/ image called scrapping 
  
These step makes the data readable 

**Timeline:**

1- 2008 development started 

2- 2009 pandas become open source 

3- 2012 first edition of pandas was publish for DATA Analysis 

4- 2015 pandas became a "NumFOCUS Sponsored project"

5- 2018 first in person core developer spirit


+------------------+------+-------------------+
|  ### DATA FRAME  |  VS  |   EXCEL WORKSHEET |
|                  |      |                   |
|SERIES            |      |        COLUMNS    |
|                  |      |                   |
|INDEX             |      |    ROW HEADINGS   |
|                  |      |                   |
|ROW               |      |        ROW        |
|                  |      |                   |
|NaN               |      |     EMPTY CELL    |
+------------------+------+-------------------+


# Pandas Practice

In [49]:
# Install pandas 
pip install pandas    # for window

# install for mac
# pip3 install pandas

SyntaxError: invalid syntax (2837108489.py, line 2)

In [5]:
# import pandas 
import pandas as pd

In [6]:
# object creation 
s=pd.Series([1,2,3])
print(s, ": The object we created. ")

0    1
1    2
2    3
dtype: int64 : The object we created.

In [7]:
# to add empty cell in the above created array 
import numpy as np
s1 = pd.Series([1,2,3, np.nan, 5,6,7])
print(s1, ": is the object we created. ")

0    1.0
1    2.0
2    3.0
3    NaN
4    5.0
5    6.0
6    7.0
dtype: float64 : is the object we created.

In [8]:
# create date series 
dates=pd.date_range("20240709", periods=6)  # we can change the periods according to our needs 
print(dates, ":is the date series that we created.no exclusive concept here that we studied in numpy here.")

DatetimeIndex(['2024-07-09', '2024-07-10', '2024-07-11', '2024-07-12',
               '2024-07-13', '2024-07-14'],
              dtype='datetime64[ns]', freq='D') :is the date series that we created.no exclusive concept here that we studied in numpy here.

In [9]:
# To create it into DataFrame 
dataframe=pd.DataFrame(np.random.randn(6,4),index=dates, columns=list("ABCD"))       # (6,4)  => (rows,columns)
print(dataframe, ": is the dataframe that we created. DataFrame is similar to excel workbook. see")

# If we look to the above dates series that we created, weh have 6 periods, thats why we created 6 rows. 
# we can increase the number of columns.

                   A         B         C         D
2024-07-09 -0.058930  0.490527 -0.236268  0.132666
2024-07-10 -0.470699  1.062376  0.122089 -0.448934
2024-07-11 -1.294913 -1.388746 -0.118229  0.215380
2024-07-12  0.315934  0.476434  0.976290  0.180461
2024-07-13 -0.416269 -0.214135  0.312435 -0.858065
2024-07-14  1.507672 -0.980203  0.888048  1.390121 : is the dataframe that we created. DataFrame is similar to excel workbook. see

In [10]:
# creating a DataFrame
df2=pd.DataFrame(
    {
        "A":1.0,
        "B":pd.Timestamp("20240709"),
        "C":pd.Series(1,index=list(range(4)),dtype="float32"),
        "D":np.array([3]*4, dtype="int32"),
        "E":pd.Categorical(["Text", "Train","Text", "Train"]),
        "F": "food"
    }
)
print(df2)
print( "The dataframe that we created. It would be better to write just df2 after the code. look below...")

     A          B    C  D      E     F
0  1.0 2024-07-09  1.0  3   Text  food
1  1.0 2024-07-09  1.0  3  Train  food
2  1.0 2024-07-09  1.0  3   Text  food
3  1.0 2024-07-09  1.0  3  Train  food
The dataframe that we created. It would be better to write just df2 after the code. look below...

In [12]:
# creating a DataFrame
df2=pd.DataFrame(
    {
        "A":1.0,
        "B":pd.Timestamp("20240709"),
        "C":pd.Series(1,index=list(range(4)),dtype="float32"),
        "D":np.array([3]*4, dtype="int32"),
        "E":pd.Categorical(["Text", "Train","Text", "Train"]),
        "F": "food"
    }
)
df2

     A          B    C  D      E     F
0  1.0 2024-07-09  1.0  3   Text  food
1  1.0 2024-07-09  1.0  3  Train  food
2  1.0 2024-07-09  1.0  3   Text  food
3  1.0 2024-07-09  1.0  3  Train  food

Now if we look and compare the above last two tables the last table look more professional.

In [13]:
# same as above and look what look different 
df3=pd.DataFrame(
    {
        "A":1.0,
        "B":pd.Timestamp("20240709"),
        "C":pd.Series(1,index=list(range(4)),dtype="float32"),
        "D":np.array([3]*4, dtype="int32"),
        "E":pd.Categorical(["Girl", "Boy","Girl", "Boy"]),
        "F": "Computer"
    }
)
df3

     A          B    C  D     E         F
0  1.0 2024-07-09  1.0  3  Girl  Computer
1  1.0 2024-07-09  1.0  3   Boy  Computer
2  1.0 2024-07-09  1.0  3  Girl  Computer
3  1.0 2024-07-09  1.0  3   Boy  Computer

Using the above codes we can make dataframes.

- To Check the type of DataFrame

In [14]:
# importing pandas module
import pandas as pd

In [15]:
# to check the type of data frames
print(dataframe.dtypes, ": If we look at the dataframe table, we see that date is at the index place")

A    float64
B    float64
C    float64
D    float64
dtype: object : If we look at the dataframe table, we see that date is at the index place

In [16]:
# same as above 
print(df2.dtypes, ": If we look at the above df2 each section can clearly be seen and understood.")

A          float64
B    datetime64[s]
C          float32
D            int32
E         category
F           object
dtype: object : If we look at the above df2 each section can clearly be seen and understood.

In [17]:
df3.dtypes

A          float64
B    datetime64[s]
C          float32
D            int32
E         category
F           object
dtype: object

In [18]:
# to view the dataframe head
print(dataframe.head(), ": The first rows and headings of our dataframe.")

                   A         B         C         D
2024-07-09 -0.058930  0.490527 -0.236268  0.132666
2024-07-10 -0.470699  1.062376  0.122089 -0.448934
2024-07-11 -1.294913 -1.388746 -0.118229  0.215380
2024-07-12  0.315934  0.476434  0.976290  0.180461
2024-07-13 -0.416269 -0.214135  0.312435 -0.858065 : The first rows and headings of our dataframe.

In [19]:
dataframe.head()

                   A         B         C         D
2024-07-09 -0.058930  0.490527 -0.236268  0.132666
2024-07-10 -0.470699  1.062376  0.122089 -0.448934
2024-07-11 -1.294913 -1.388746 -0.118229  0.215380
2024-07-12  0.315934  0.476434  0.976290  0.180461
2024-07-13 -0.416269 -0.214135  0.312435 -0.858065

Look and see the above last two tables, we see difference between the dataframe tables with **'print'** and **'without print'** function.

In [20]:
# to see the last 5 rows of our data set
dataframe.tail()

                   A         B         C         D
2024-07-10 -0.470699  1.062376  0.122089 -0.448934
2024-07-11 -1.294913 -1.388746 -0.118229  0.215380
2024-07-12  0.315934  0.476434  0.976290  0.180461
2024-07-13 -0.416269 -0.214135  0.312435 -0.858065
2024-07-14  1.507672 -0.980203  0.888048  1.390121

In [21]:
# to check the indexes 
dataframe.index

DatetimeIndex(['2024-07-09', '2024-07-10', '2024-07-11', '2024-07-12',
               '2024-07-13', '2024-07-14'],
              dtype='datetime64[ns]', freq='D')

If we look our dataframe dates are our indexes. As I mentioned earlier.

In [22]:
# df is the short name of dataframe 
print(df2.index, "=> : the indexes of df2.")

Index([0, 1, 2, 3], dtype='int64') => : the indexes of df2.

In [23]:
print(df3.index, "=> : the indexes of df3.")

Index([0, 1, 2, 3], dtype='int64') => : the indexes of df3.

- **Converting DataFrame to Numpy**

In [24]:
# Now if we wish to convert our dataframe (worksheet) into Numpy array
print(dataframe.to_numpy, ": We converted the dataframe to numpy array. ")

<bound method DataFrame.to_numpy of                    A         B         C         D
2024-07-09 -0.058930  0.490527 -0.236268  0.132666
2024-07-10 -0.470699  1.062376  0.122089 -0.448934
2024-07-11 -1.294913 -1.388746 -0.118229  0.215380
2024-07-12  0.315934  0.476434  0.976290  0.180461
2024-07-13 -0.416269 -0.214135  0.312435 -0.858065
2024-07-14  1.507672 -0.980203  0.888048  1.390121> : We converted the dataframe to numpy array.

In [25]:
print(df2.to_numpy, ": We converted the dataframe to numpy array. ")

<bound method DataFrame.to_numpy of      A          B    C  D      E     F
0  1.0 2024-07-09  1.0  3   Text  food
1  1.0 2024-07-09  1.0  3  Train  food
2  1.0 2024-07-09  1.0  3   Text  food
3  1.0 2024-07-09  1.0  3  Train  food> : We converted the dataframe to numpy array.

In [26]:
#  same as above
df3.to_numpy()

array([[1.0, Timestamp('2024-07-09 00:00:00'), 1.0, 3, 'Girl',
        'Computer'],
       [1.0, Timestamp('2024-07-09 00:00:00'), 1.0, 3, 'Boy', 'Computer'],
       [1.0, Timestamp('2024-07-09 00:00:00'), 1.0, 3, 'Girl',
        'Computer'],
       [1.0, Timestamp('2024-07-09 00:00:00'), 1.0, 3, 'Boy', 'Computer']],
      dtype=object)

______
The following command will give us **Statistical descriptions**.

In [27]:
# if we wish to check our data statistically, then
dataframe.describe()

              A         B         C         D
count  6.000000  6.000000  6.000000  6.000000
mean  -0.069534 -0.092291  0.324061  0.101938
std    0.940105  0.946616  0.508724  0.762163
min   -1.294913 -1.388746 -0.236268 -0.858065
25%   -0.457092 -0.788686 -0.058150 -0.303534
50%   -0.237600  0.131149  0.217262  0.156564
75%    0.222218  0.487003  0.744145  0.206650
max    1.507672  1.062376  0.976290  1.390121

Same for the other...

In [28]:
df2.describe()

         A                    B    C    D
count  4.0                    4  4.0  4.0
mean   1.0  2024-07-09 00:00:00  1.0  3.0
min    1.0  2024-07-09 00:00:00  1.0  3.0
25%    1.0  2024-07-09 00:00:00  1.0  3.0
50%    1.0  2024-07-09 00:00:00  1.0  3.0
75%    1.0  2024-07-09 00:00:00  1.0  3.0
max    1.0  2024-07-09 00:00:00  1.0  3.0
std    0.0                  NaN  0.0  0.0

In [24]:
df3.describe()

         A                    B    C    D
count  4.0                    4  4.0  4.0
mean   1.0  2024-07-09 00:00:00  1.0  3.0
min    1.0  2024-07-09 00:00:00  1.0  3.0
25%    1.0  2024-07-09 00:00:00  1.0  3.0
50%    1.0  2024-07-09 00:00:00  1.0  3.0
75%    1.0  2024-07-09 00:00:00  1.0  3.0
max    1.0  2024-07-09 00:00:00  1.0  3.0
std    0.0                  NaN  0.0  0.0

_________
Some other function that can be applied on DataFrame.

To **Transpose** the dataframe, just do the following.

In [29]:
# transpose of the data set (row to column)
df2.T

,0,1,2,3
A,1.0,1.0,1.0,1.0
B,2024-07-09 00:00:00,2024-07-09 00:00:00,2024-07-09 00:00:00,2024-07-09 00:00:00
C,1.0,1.0,1.0,1.0
D,3,3,3,3
E,Text,Train,Text,Train
F,food,food,food,food

To **Sorting** the dataframe, just do the following.

In [30]:
# sorting the data frame
dataframe.sort_index(axis=1,ascending=False)

                   D         C         B         A
2024-07-09  0.132666 -0.236268  0.490527 -0.058930
2024-07-10 -0.448934  0.122089  1.062376 -0.470699
2024-07-11  0.215380 -0.118229 -1.388746 -1.294913
2024-07-12  0.180461  0.976290  0.476434  0.315934
2024-07-13 -0.858065  0.312435 -0.214135 -0.416269
2024-07-14  1.390121  0.888048 -0.980203  1.507672

In [31]:
dataframe.sort_index(axis=0,ascending=False)

                   A         B         C         D
2024-07-14  1.507672 -0.980203  0.888048  1.390121
2024-07-13 -0.416269 -0.214135  0.312435 -0.858065
2024-07-12  0.315934  0.476434  0.976290  0.180461
2024-07-11 -1.294913 -1.388746 -0.118229  0.215380
2024-07-10 -0.470699  1.062376  0.122089 -0.448934
2024-07-09 -0.058930  0.490527 -0.236268  0.132666

In [28]:
dataframe.sort_index(axis=1,ascending=True)

                   A         B         C         D
2024-07-09 -0.513459  0.037814 -0.135259 -0.261791
2024-07-10 -0.539776 -1.059604 -0.115131  0.444901
2024-07-11  1.165359 -0.684750 -0.898452  0.209869
2024-07-12 -1.572290 -0.271557 -2.360871  0.830212
2024-07-13  0.566620 -1.257953 -0.935434 -0.414092
2024-07-14  0.431193 -0.522250  0.658425  0.603427

In [32]:
dataframe.sort_index(axis=0,ascending=True)

                   A         B         C         D
2024-07-09 -0.058930  0.490527 -0.236268  0.132666
2024-07-10 -0.470699  1.062376  0.122089 -0.448934
2024-07-11 -1.294913 -1.388746 -0.118229  0.215380
2024-07-12  0.315934  0.476434  0.976290  0.180461
2024-07-13 -0.416269 -0.214135  0.312435 -0.858065
2024-07-14  1.507672 -0.980203  0.888048  1.390121

In [31]:
# sorting values by specific columns
dataframe.sort_values(by="B", ascending=False)

                   A         B         C         D
2024-07-09 -0.513459  0.037814 -0.135259 -0.261791
2024-07-12 -1.572290 -0.271557 -2.360871  0.830212
2024-07-14  0.431193 -0.522250  0.658425  0.603427
2024-07-11  1.165359 -0.684750 -0.898452  0.209869
2024-07-10 -0.539776 -1.059604 -0.115131  0.444901
2024-07-13  0.566620 -1.257953 -0.935434 -0.414092

You have seen the magic of the sorting function. Hpefully got the idea...
____

- _**Filteration:**_
Selecting **Specific column/s** in the dataframe

In [33]:
# to select single column by name
dataframe["A"]   # same for all others, it is also called filtration.

2024-07-09   -0.058930
2024-07-10   -0.470699
2024-07-11   -1.294913
2024-07-12    0.315934
2024-07-13   -0.416269
2024-07-14    1.507672
Freq: D, Name: A, dtype: float64

In [34]:
# Row wise selection 
dataframe[0:3]   # first 3 rows  [from:to]

                   A         B         C         D
2024-07-09 -0.058930  0.490527 -0.236268  0.132666
2024-07-10 -0.470699  1.062376  0.122089 -0.448934
2024-07-11 -1.294913 -1.388746 -0.118229  0.215380

In [35]:
# Row wise selection 
dataframe[0:2]   # first 2 rows  [from:to]

                   A         B         C         D
2024-07-09 -0.058930  0.490527 -0.236268  0.132666
2024-07-10 -0.470699  1.062376  0.122089 -0.448934

In [36]:
# select by labels/. Headings
dataframe.loc[dates[0]]    # it will give us dates column data

A   -0.058930
B    0.490527
C   -0.236268
D    0.132666
Name: 2024-07-09 00:00:00, dtype: float64

In [37]:
dataframe.loc[:,["A","B"]]   # (:)all rows and [columns A and B]

                   A         B
2024-07-09 -0.058930  0.490527
2024-07-10 -0.470699  1.062376
2024-07-11 -1.294913 -1.388746
2024-07-12  0.315934  0.476434
2024-07-13 -0.416269 -0.214135
2024-07-14  1.507672 -0.980203

In [38]:
dataframe.loc["20240709" : "20240711",["A","B"]]   # it will take data from dates to dates from column A and B.

                   A         B
2024-07-09 -0.058930  0.490527
2024-07-10 -0.470699  1.062376
2024-07-11 -1.294913 -1.388746

**(from : to)   ....    (this  ,  this) **

In [39]:
# we can add column as 
dataframe.loc["20240709" : "20240711",["A","B","C"]]

                   A         B         C
2024-07-09 -0.058930  0.490527 -0.236268
2024-07-10 -0.470699  1.062376  0.122089
2024-07-11 -1.294913 -1.388746 -0.118229

In [40]:
# to access a specified item through index # it will take data from datas at zero index of column A. 
dataframe.at[dates[0],"A"]

-0.05892995961241362

Which can be confirmed from the above last table...

In [41]:
dataframe.at[dates[2],"A"]   # it will take data from datas at 5 index of column A.

-1.294912743959064

You can confirm from the last table in column A. Last item of Column A.

In [42]:
dataframe.iloc[2]   # it will take rwo-wise data from index two, look at the above last table. 
# It will be displayed in column format.

A   -1.294913
B   -1.388746
C   -0.118229
D    0.215380
Name: 2024-07-11 00:00:00, dtype: float64

In [43]:
dataframe.iloc[3:7]   # it will return the data from index 3 to index 6. 
# We entered index 7 which is not present in our data. 
# So it return the last indexed values from all columns.

                   A         B         C         D
2024-07-12  0.315934  0.476434  0.976290  0.180461
2024-07-13 -0.416269 -0.214135  0.312435 -0.858065
2024-07-14  1.507672 -0.980203  0.888048  1.390121

In [45]:
dataframe.iloc[0:5,0:15]

                   A         B         C         D
2024-07-09 -0.058930  0.490527 -0.236268  0.132666
2024-07-10 -0.470699  1.062376  0.122089 -0.448934
2024-07-11 -1.294913 -1.388746 -0.118229  0.215380
2024-07-12  0.315934  0.476434  0.976290  0.180461
2024-07-13 -0.416269 -0.214135  0.312435 -0.858065

In [46]:
dataframe.iloc[0:5,0:3]

                   A         B         C
2024-07-09 -0.058930  0.490527 -0.236268
2024-07-10 -0.470699  1.062376  0.122089
2024-07-11 -1.294913 -1.388746 -0.118229
2024-07-12  0.315934  0.476434  0.976290
2024-07-13 -0.416269 -0.214135  0.312435

In [47]:
dataframe.iloc[0:5,:]    # [from : to , : all columns]

                   A         B         C         D
2024-07-09 -0.058930  0.490527 -0.236268  0.132666
2024-07-10 -0.470699  1.062376  0.122089 -0.448934
2024-07-11 -1.294913 -1.388746 -0.118229  0.215380
2024-07-12  0.315934  0.476434  0.976290  0.180461
2024-07-13 -0.416269 -0.214135  0.312435 -0.858065

In [48]:
dataframe.iloc[:,0:2]    # [: all rows ,  from : to]

                   A         B
2024-07-09 -0.058930  0.490527
2024-07-10 -0.470699  1.062376
2024-07-11 -1.294913 -1.388746
2024-07-12  0.315934  0.476434
2024-07-13 -0.416269 -0.214135
2024-07-14  1.507672 -0.980203

In [49]:
# filtering the values 
dataframe[dataframe["A"]>0]   # we have taken greater than zeros values in column A

                   A         B         C         D
2024-07-12  0.315934  0.476434  0.976290  0.180461
2024-07-14  1.507672 -0.980203  0.888048  1.390121

In [50]:
dataframe[dataframe["A"]>1.1]      # consider only column A

                   A         B         C         D
2024-07-14  1.507672 -0.980203  0.888048  1.390121

In [51]:
dataframe[dataframe["B"]>1.2]    # Consider only column B. Column B have no values greater than 1.2.

Empty DataFrame
Columns: [A, B, C, D]
Index: []

In [52]:
# for complete dataframe, either all the values greater than zero 1. 
df3=dataframe[dataframe>1]
df3

                   A         B   C         D
2024-07-09       NaN       NaN NaN       NaN
2024-07-10       NaN  1.062376 NaN       NaN
2024-07-11       NaN       NaN NaN       NaN
2024-07-12       NaN       NaN NaN       NaN
2024-07-13       NaN       NaN NaN       NaN
2024-07-14  1.507672       NaN NaN  1.390121

In [53]:
df4=dataframe[dataframe>0]
df4

                   A         B         C         D
2024-07-09       NaN  0.490527       NaN  0.132666
2024-07-10       NaN  1.062376  0.122089       NaN
2024-07-11       NaN       NaN       NaN  0.215380
2024-07-12  0.315934  0.476434  0.976290  0.180461
2024-07-13       NaN       NaN  0.312435       NaN
2024-07-14  1.507672       NaN  0.888048  1.390121

Missing Values in Between are represented as NaN. Here NaN show where the condition got false.

In [54]:
# copy of dataframe 4. 
df5=df4.copy()
df5
# You can verify the result.

                   A         B         C         D
2024-07-09       NaN  0.490527       NaN  0.132666
2024-07-10       NaN  1.062376  0.122089       NaN
2024-07-11       NaN       NaN       NaN  0.215380
2024-07-12  0.315934  0.476434  0.976290  0.180461
2024-07-13       NaN       NaN  0.312435       NaN
2024-07-14  1.507672       NaN  0.888048  1.390121

In [55]:
df4   # Again verified

                   A         B         C         D
2024-07-09       NaN  0.490527       NaN  0.132666
2024-07-10       NaN  1.062376  0.122089       NaN
2024-07-11       NaN       NaN       NaN  0.215380
2024-07-12  0.315934  0.476434  0.976290  0.180461
2024-07-13       NaN       NaN  0.312435       NaN
2024-07-14  1.507672       NaN  0.888048  1.390121

- **Adding New Column to Existing DataFrame**

In [56]:
# now to add column 
df4["mean"] = df4["B"] * 2
df4

                   A         B         C         D      mean
2024-07-09       NaN  0.490527       NaN  0.132666  0.981054
2024-07-10       NaN  1.062376  0.122089       NaN  2.124751
2024-07-11       NaN       NaN       NaN  0.215380       NaN
2024-07-12  0.315934  0.476434  0.976290  0.180461  0.952867
2024-07-13       NaN       NaN  0.312435       NaN       NaN
2024-07-14  1.507672       NaN  0.888048  1.390121       NaN

In [57]:
# repeated the above again

# now to add column 
df4["mean"] = df4["B"] * 2
print(df4, ": Added new column with name 'Mean' from multiplying 2 with column B")
print("We see many NaN terms in mean, something multiplied with 0 got 0 or with NaN got NaN.")

                   A         B         C         D      mean
2024-07-09       NaN  0.490527       NaN  0.132666  0.981054
2024-07-10       NaN  1.062376  0.122089       NaN  2.124751
2024-07-11       NaN       NaN       NaN  0.215380       NaN
2024-07-12  0.315934  0.476434  0.976290  0.180461  0.952867
2024-07-13       NaN       NaN  0.312435       NaN       NaN
2024-07-14  1.507672       NaN  0.888048  1.390121       NaN : Added new column with name 'Mean' from multiplying 2 with column B
We see many NaN terms in mean, something multiplied with 0 got 0 or with NaN got NaN.

In [58]:
df4["mean"] = df4["B"] * 1.2
df4

                   A         B         C         D      mean
2024-07-09       NaN  0.490527       NaN  0.132666  0.588632
2024-07-10       NaN  1.062376  0.122089       NaN  1.274851
2024-07-11       NaN       NaN       NaN  0.215380       NaN
2024-07-12  0.315934  0.476434  0.976290  0.180461  0.571720
2024-07-13       NaN       NaN  0.312435       NaN       NaN
2024-07-14  1.507672       NaN  0.888048  1.390121       NaN

In [59]:
df4

                   A         B         C         D      mean
2024-07-09       NaN  0.490527       NaN  0.132666  0.588632
2024-07-10       NaN  1.062376  0.122089       NaN  1.274851
2024-07-11       NaN       NaN       NaN  0.215380       NaN
2024-07-12  0.315934  0.476434  0.976290  0.180461  0.571720
2024-07-13       NaN       NaN  0.312435       NaN       NaN
2024-07-14  1.507672       NaN  0.888048  1.390121       NaN

In [60]:
df4["mean"] = df4["D"] + 1.2
df4

                   A         B         C         D      mean
2024-07-09       NaN  0.490527       NaN  0.132666  1.332666
2024-07-10       NaN  1.062376  0.122089       NaN       NaN
2024-07-11       NaN       NaN       NaN  0.215380  1.415380
2024-07-12  0.315934  0.476434  0.976290  0.180461  1.380461
2024-07-13       NaN       NaN  0.312435       NaN       NaN
2024-07-14  1.507672       NaN  0.888048  1.390121  2.590121

Consider Column B and Add 1.2 with each corresponding term terms we got mean. You can Verify.

In [67]:
import numpy as np
# create a list of values
# create a new column with the specified values
new_column = np.array([1.2, 4.5, 7, 8, 0.2, 7])

# add the new column to df4
df4["New"] = new_column
df4

                   A         B         C         D      mean  New
2024-07-09       NaN  0.490527       NaN  0.132666  1.332666  1.2
2024-07-10       NaN  1.062376  0.122089       NaN       NaN  4.5
2024-07-11       NaN       NaN       NaN  0.215380  1.415380  7.0
2024-07-12  0.315934  0.476434  0.976290  0.180461  1.380461  8.0
2024-07-13       NaN       NaN  0.312435       NaN       NaN  0.2
2024-07-14  1.507672       NaN  0.888048  1.390121  2.590121  7.0

In [ ]:
# Assignment: find the solution to get a sum of A,B,C,D and add another column to get average column of the data 
df4['New_Mean'] = df4[['A', 'B', 'C', 'D', 'Mean']].mean(axis=0)